ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/C29/f29h85x_outputxbar_flag_regs.xml
<module id="OUTPUTXBAR_FLAG_REGS" HW_revision="" description="OUTPUTXBAR FLAG Registers">
	<register id="OUTPUTXBARStatus" width="32" page="0" offset="0x10" instances="1" instaddr="4" internal="0" description="Output Signal Status register">
		<bitfield id="STS" description="Output Signal Status" begin="0" end="0" width="1" rwaccess="R"/>
	</register>
	<register id="OUTPUTXBARFlag" width="32" page="0" offset="0x18" instances="1" instaddr="4" internal="0" description="Output latched flag register">
		<bitfield id="FLG" description="Output Signal Latched Flag Status" begin="0" end="0" width="1" rwaccess="R"/>
	</register>
	<register id="OUTPUTXBARFlagClear" width="32" page="0" offset="0x1c" instances="1" instaddr="4" internal="0" description="Output latched flag clear register">
		<bitfield id="FLG" description="Output Signal Latched Flag Clear" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="OUTPUTXBARFlagForce" width="32" page="0" offset="0x20" instances="1" instaddr="4" internal="0" description="Output latched flag Force register">
		<bitfield id="FLG" description="Output Signal Latched Flag Force" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
</module>
